experiments/workflow/beldi-movie/expected_results/qps50/wrk.log
Running 2m test @ http://ip-172-31-15-142.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 3.915ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.718ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.81ms   11.71ms  48.80ms   91.37%
    Req/Sec    26.08     49.61   222.00     77.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.15ms
 75.000%    1.47ms
 90.000%    5.09ms
 99.000%   44.80ms
 99.900%   45.31ms
 99.990%   48.80ms
 99.999%   48.83ms
100.000%   48.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.262     0.000000            1         1.00
       0.624     0.100000          700         1.11
       0.771     0.200000         1401         1.25
       0.905     0.300000         2102         1.43
       1.030     0.400000         2800         1.67
       1.153     0.500000         3504         2.00
       1.208     0.550000         3850         2.22
       1.255     0.600000         4201         2.50
       1.307     0.650000         4554         2.86
       1.367     0.700000         4899         3.33
       1.474     0.750000         5249         4.00
       1.525     0.775000         5431         4.44
       1.565     0.800000         5600         5.00
       1.611     0.825000         5776         5.71
       1.658     0.850000         5951         6.67
       1.744     0.875000         6127         8.00
       5.023     0.887500         6215         8.89
       5.091     0.900000         6302        10.00
       5.631     0.912500         6386        11.43
      41.311     0.925000         6478        13.33
      41.375     0.937500         6742        16.00
      41.375     0.943750         6742        17.78
      41.375     0.950000         6742        20.00
      41.375     0.956250         6742        22.86
      41.375     0.962500         6742        26.67
      44.767     0.968750         6831        32.00
      44.767     0.971875         6831        35.56
      44.767     0.975000         6831        40.00
      44.799     0.978125         6980        45.71
      44.799     0.981250         6980        53.33
      44.799     0.984375         6980        64.00
      44.799     0.985938         6980        71.11
      44.799     0.987500         6980        80.00
      44.799     0.989062         6980        91.43
      44.799     0.990625         6980       106.67
      44.799     0.992188         6980       128.00
      44.799     0.992969         6980       142.22
      44.799     0.993750         6980       160.00
      44.799     0.994531         6980       182.86
      44.799     0.995313         6980       213.33
      44.799     0.996094         6980       256.00
      44.799     0.996484         6980       284.44
      44.799     0.996875         6980       320.00
      44.799     0.997266         6980       365.71
      44.831     0.997656         6986       426.67
      44.831     0.998047         6986       512.00
      44.831     0.998242         6986       568.89
      45.311     0.998437         6992       640.00
      45.311     0.998633         6992       731.43
      45.311     0.998828         6992       853.33
      45.311     0.999023         6992      1024.00
      45.311     0.999121         6992      1137.78
      48.767     0.999219         6993      1280.00
      48.799     0.999316         6997      1462.86
      48.799     0.999414         6997      1706.67
      48.799     0.999512         6997      2048.00
      48.799     0.999561         6997      2275.56
      48.799     0.999609         6997      2560.00
      48.799     0.999658         6997      2925.71
      48.799     0.999707         6997      3413.33
      48.799     0.999756         6997      4096.00
      48.799     0.999780         6997      4551.11
      48.799     0.999805         6997      5120.00
      48.799     0.999829         6997      5851.43
      48.799     0.999854         6997      6826.67
      48.831     0.999878         6998      8192.00
      48.831     1.000000         6998          inf
#[Mean    =        4.809, StdDeviation   =       11.705]
#[Max     =       48.800, Total count    =         6998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  226.00us
 75.000%  296.00us
 90.000%  339.00us
 99.000%   43.65ms
 99.900%   44.67ms
 99.990%   47.71ms
 99.999%   47.71ms
100.000%   47.71ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.144     0.000000            1         1.00
       0.178     0.100000          750         1.11
       0.186     0.200000         1409         1.25
       0.194     0.300000         2156         1.43
       0.203     0.400000         2806         1.67
       0.226     0.500000         3500         2.00
       0.254     0.550000         3853         2.22
       0.268     0.600000         4200         2.50
       0.279     0.650000         4575         2.86
       0.288     0.700000         4933         3.33
       0.296     0.750000         5251         4.00
       0.301     0.775000         5456         4.44
       0.305     0.800000         5625         5.00
       0.310     0.825000         5805         5.71
       0.316     0.850000         5957         6.67
       0.324     0.875000         6129         8.00
       0.329     0.887500         6212         8.89
       0.339     0.900000         6305        10.00
       0.364     0.912500         6386        11.43
      40.575     0.925000         6477        13.33
      40.639     0.937500         6590        16.00
      40.671     0.943750         6641        17.78
      40.703     0.950000         6683        20.00
      40.735     0.956250         6720        22.86
      40.767     0.962500         6746        26.67
      43.487     0.968750         6787        32.00
      43.519     0.971875         6812        35.56
      43.551     0.975000         6838        40.00
      43.583     0.978125         6871        45.71
      43.583     0.981250         6871        53.33
      43.615     0.984375         6908        64.00
      43.615     0.985938         6908        71.11
      43.647     0.987500         6933        80.00
      43.647     0.989062         6933        91.43
      43.647     0.990625         6933       106.67
      43.679     0.992188         6957       128.00
      43.679     0.992969         6957       142.22
      43.679     0.993750         6957       160.00
      43.711     0.994531         6976       182.86
      43.711     0.995313         6976       213.33
      43.711     0.996094         6976       256.00
      43.711     0.996484         6976       284.44
      43.743     0.996875         6985       320.00
      43.743     0.997266         6985       365.71
      43.743     0.997656         6985       426.67
      43.743     0.998047         6985       512.00
      43.775     0.998242         6986       568.89
      44.607     0.998437         6988       640.00
      44.639     0.998633         6990       731.43
      44.639     0.998828         6990       853.33
      44.735     0.999023         6992      1024.00
      44.735     0.999121         6992      1137.78
      47.519     0.999219         6993      1280.00
      47.551     0.999316         6994      1462.86
      47.551     0.999414         6994      1706.67
      47.583     0.999512         6995      2048.00
      47.583     0.999561         6995      2275.56
      47.647     0.999609         6996      2560.00
      47.647     0.999658         6996      2925.71
      47.647     0.999707         6996      3413.33
      47.711     0.999756         6998      4096.00
      47.711     1.000000         6998          inf
#[Mean    =        3.827, StdDeviation   =       11.699]
#[Max     =       47.680, Total count    =         6998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7502 requests in 2.50m, 1.17MB read
Requests/sec:     50.01
Transfer/sec:      7.96KB