experiments/workflow/beldi-movie/expected_results/qps50/wrk_warmup.log
Running 30s test @ http://ip-172-31-15-142.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 0.900ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.958ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms  297.70us   1.78ms   61.32%
    Req/Sec    26.10     45.13   111.00     74.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.07ms
 75.000%    1.35ms
 90.000%    1.49ms
 99.000%    1.65ms
 99.900%    1.71ms
 99.990%    1.78ms
 99.999%    1.78ms
100.000%    1.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.467     0.000000            1         1.00
       0.687     0.100000          100         1.11
       0.805     0.200000          201         1.25
       0.884     0.300000          301         1.43
       0.980     0.400000          401         1.67
       1.070     0.500000          499         2.00
       1.120     0.550000          550         2.22
       1.193     0.600000          599         2.50
       1.241     0.650000          649         2.86
       1.295     0.700000          699         3.33
       1.349     0.750000          749         4.00
       1.368     0.775000          774         4.44
       1.388     0.800000          799         5.00
       1.416     0.825000          826         5.71
       1.436     0.850000          849         6.67
       1.454     0.875000          874         8.00
       1.479     0.887500          887         8.89
       1.489     0.900000          899        10.00
       1.495     0.912500          911        11.43
       1.512     0.925000          924        13.33
       1.530     0.937500          936        16.00
       1.542     0.943750          942        17.78
       1.549     0.950000          949        20.00
       1.559     0.956250          955        22.86
       1.574     0.962500          961        26.67
       1.593     0.968750          968        32.00
       1.597     0.971875          970        35.56
       1.612     0.975000          975        40.00
       1.620     0.978125          977        45.71
       1.627     0.981250          981        53.33
       1.628     0.984375          983        64.00
       1.636     0.985938          984        71.11
       1.646     0.987500          986        80.00
       1.652     0.989062          988        91.43
       1.653     0.990625          989       106.67
       1.676     0.992188          991       128.00
       1.676     0.992969          991       142.22
       1.677     0.993750          992       160.00
       1.684     0.994531          993       182.86
       1.687     0.995313          994       213.33
       1.692     0.996094          995       256.00
       1.692     0.996484          995       284.44
       1.692     0.996875          995       320.00
       1.693     0.997266          996       365.71
       1.693     0.997656          996       426.67
       1.705     0.998047          997       512.00
       1.705     0.998242          997       568.89
       1.705     0.998437          997       640.00
       1.705     0.998633          997       731.43
       1.705     0.998828          997       853.33
       1.783     0.999023          998      1024.00
       1.783     1.000000          998          inf
#[Mean    =        1.088, StdDeviation   =        0.298]
#[Max     =        1.783, Total count    =          998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  240.00us
 75.000%  278.00us
 90.000%  298.00us
 99.000%  322.00us
 99.900%  363.00us
 99.990%  377.00us
 99.999%  377.00us
100.000%  377.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.164     0.000000            1         1.00
       0.195     0.100000          102         1.11
       0.204     0.200000          205         1.25
       0.213     0.300000          313         1.43
       0.221     0.400000          404         1.67
       0.240     0.500000          500         2.00
       0.249     0.550000          550         2.22
       0.259     0.600000          605         2.50
       0.265     0.650000          657         2.86
       0.271     0.700000          699         3.33
       0.278     0.750000          750         4.00
       0.281     0.775000          775         4.44
       0.284     0.800000          802         5.00
       0.287     0.825000          828         5.71
       0.291     0.850000          856         6.67
       0.294     0.875000          877         8.00
       0.296     0.887500          890         8.89
       0.298     0.900000          902        10.00
       0.300     0.912500          913        11.43
       0.303     0.925000          929        13.33
       0.304     0.937500          936        16.00
       0.305     0.943750          942        17.78
       0.307     0.950000          951        20.00
       0.308     0.956250          955        22.86
       0.310     0.962500          963        26.67
       0.311     0.968750          968        32.00
       0.312     0.971875          971        35.56
       0.313     0.975000          974        40.00
       0.315     0.978125          978        45.71
       0.318     0.981250          982        53.33
       0.319     0.984375          983        64.00
       0.320     0.985938          984        71.11
       0.322     0.987500          988        80.00
       0.322     0.989062          988        91.43
       0.323     0.990625          989       106.67
       0.329     0.992188          991       128.00
       0.329     0.992969          991       142.22
       0.332     0.993750          992       160.00
       0.335     0.994531          993       182.86
       0.337     0.995313          994       213.33
       0.345     0.996094          995       256.00
       0.345     0.996484          995       284.44
       0.345     0.996875          995       320.00
       0.363     0.997266          997       365.71
       0.363     0.997656          997       426.67
       0.363     0.998047          997       512.00
       0.363     0.998242          997       568.89
       0.363     0.998437          997       640.00
       0.363     0.998633          997       731.43
       0.363     0.998828          997       853.33
       0.377     0.999023          998      1024.00
       0.377     1.000000          998          inf
#[Mean    =        0.243, StdDeviation   =        0.040]
#[Max     =        0.377, Total count    =          998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1502 requests in 30.00s, 239.09KB read
Requests/sec:     50.06
Transfer/sec:      7.97KB